#требует у пользователя ввести два целых числа строку и дробное
#A = int(input("введи целое число: "))
#S = int(input("введи целое число: "))
#D = input("введи строку: ")
#F = float(input("введи дробное число: "))
#print(D)
#print (A+S+F)

#создать 4 переменных с типом целых чисел, логическим и строковым. преобразовать числа в строку
# q = 1
# w = 3.0
# e = True
# r = "Небо"
# q = str(q)
# w = str(w)

#вывести на экран фио в одну строку, возраст и город в разные
#a = input("введи имя: ")
#s = input("введи фамилию: ")
#d = input("введи отчество: ")
#f = int(input("введи возраст: "))
#g = input("введи город: ")
#print(a,s,d)
#print(f)
#print(g)

#ввести 3 числа  и выполнить все математические действия
#a = int(input("введи число: "))
#b = int(input("введи число: "))
#c = int(input("введи число: "))
#print("Сложение:",a+b+c,"Вычетание:",a-b-c,"Умножение:",a*b*c,"Деление",a/b/c,"степень",a**b**c)
#print("Сложение:",b+a+c,"Вычетание:",b-a-c,"Умножение:",b*a*c,"Деление",b/a/c,"степень",b**a**c)
#print("Сложение:",c+b+a,"Вычетание:",c-b-a,"Умножение:",c*b*a,"Деление",c/b/a,"степень",c**b**a)
#print("Сложение:",a+c+b,"Вычетание:",a-c-b,"Умножение:",a*c*b,"Деление",a/c/b,"степень",a**c**b)
#print("Сложение:",c+a+b,"Вычетание:",c-a-b,"Умножение:",c*a*b,"Деление",c/a/b,"степень",c**a**b)
#print("Сложение:",b+c+a,"Вычетание:",b-c-a,"Умножение:",b*c*a,"Деление",b/c/a,"степень",b**c**a)

#вычислить сумму цифр случайного трехзначного числа
# import random
# n = random.randint(100,999)
# print(n)
# a = n // 100
# b = (n// 10) % 10
# c = n%10
# print ("сумма:",a + b + c)